"""
python不能理解除机械语言外的任何语言，所以必须把程序员编写的程序语言翻译成机械可读的机械语言,计算机才能够正确解读，将其他语言翻译成机械语言的工具被称为编译器
编译器翻译分为两种：     1.编译       2.解释   两种方式之间的区别是 翻译时间点不同。当编译器以解释方式运行的时候称之为解释器。
编译型语言：程序在执行之前有一个专门的编译过程，把程序编译翻译成机器语言文件，运行时不需要重新翻译，只需执行编译的结果就行。程序执行效率高，依赖编译器，跨平台型差。如C，c++
解释型语言：解释型语言编写的程序不进行预先编译，以文本方式存储程序代码，会将程序一句一句直接运行，，在发布程序时，看起来省了道编译工序，但是在运行程序的时候，必须先解释在运行



python的设计目标
    一门简单直观的语言，并与主要竞争者一样强大
    开源，以便任何人都可以为他做贡献
    代码像纯英语那样容易理解
    适用于短期开发的日常任务


python的哲学：
    优雅
    明确
    简单
    用一种方法，最好是只有一种方法来做一件事
为什么选择python语言
    代码量少
python特点：
    python是完全面向对象的语言
        函数、模块、字符串、数字都是对象、在python中一切皆为对象
        完全支持继承，重载，多重继承
        支持重载运算符，也支持泛型设计
    python拥有一个强大的标准库，python语言的核心只包含：数字，字符串，列表，字典，文件等常见的类型和函数，而python标准库提供了系统管理，网络通信，文本处理，数据库接接口，图形系统，XML等系统处理
    python社区提供了大量的第三方模块，使用方式和标准 库类似。他的功能覆盖科学计算，人工智能，机器学习，web开发，数据库接口，图形系统，多个领域
面向对象的思维方式：
    面向对象是一种思维方式，也是一门 程序设计艺术
    要解决一个问题前，要考虑 有谁 来做，怎么做事情是 谁 的职责，最后把事情做好就行
    面向对象是谁
    要解决复杂的问题，就可以找多个不同的对象，各司其职，共同实现，最终完成需求

"""
