function getRandomName() {
    var firstNames = new Array(
        '佳怡', '佳惠', '晨茜', '晨璐', '运昊', '汝鑫', '淑君', '晶滢', '润莎', '榕汕',
        '佳钰', '佳玉', '晓庆', '一鸣', '语晨', '添池', '添昊', '雨泽', '雅晗', '雅涵',
        '清妍', '诗悦', '嘉乐', '晨涵', '天赫', '玥傲', '佳昊', '天昊', '萌萌', '若萌',
        "秋白", "南风", "醉山", "初彤", "凝海", "紫文", "凌晴", "香卉", "雅琴", "傲安",
        "傲之", "初蝶", "寻桃", "代芹", "诗霜", "春柏", "绿夏", "碧灵", "诗柳", "夏柳",
        "采白", "慕梅", "乐安", "冬菱", "紫安", "宛凝", "雨雪", "易真", "安荷", "静竹",
        "飞雪", "雪兰", "雅霜", "从蓉", "冷雪", "靖巧", "翠丝", "觅翠", "凡白", "乐蓉",
        "迎波", "丹烟", "梦旋", "书双", "念桃", "夜天", "海桃", "青香", "恨风", "安筠",
        "觅柔", "初南", "秋蝶", "千易", "安露", "诗蕊", "山雁", "友菱", "香露", "晓兰",
        "涵瑶", "秋柔", "思菱", "醉柳", "以寒", "迎夏", "向雪", "香莲", "以丹", "依凝",
        "如柏", "雁菱", "凝竹", "宛白", "初柔", "南蕾", "书萱", "梦槐", "香芹", "南琴",
        "绿海", "沛儿", "晓瑶", "听春", "易巧", "念云", "晓灵", "静枫", "夏蓉", "如南",
        "幼丝", "秋白", "冰安", "凝蝶", "紫雪", "念双", "念真", "曼寒", "凡霜", "白卉",
        "语山", "冷珍", "秋翠", "夏柳", "如之", "忆南", "书易", "翠桃", "寄瑶", "如曼",
        "问柳", "香梅", "幻桃", "又菡", "春绿", "醉蝶", "亦绿", "诗珊", "听芹", "新之",
        "博瀚", "博超", "才哲", "才俊", "成和", "成弘", "昊苍", "昊昊", "昊空", "昊乾",
        "昊然", "昊然", "昊天", "昊焱", "昊英", "浩波", "浩博", "浩初", "浩大", "浩宕",
        "浩荡", "浩歌", "浩广", "浩涆", "浩瀚", "浩浩", "浩慨", "浩旷", "浩阔", "浩漫",
        "浩淼", "浩渺", "浩邈", "浩气", "浩然", "浩穰", "浩壤", "浩思", "浩言", "皓轩",
        "和蔼", "和安", "和昶", "翔东", "昊伟", "楚桥", "智霖", "浩杰", "炎承", "思哲",
        "璟新", "楚怀", "继智", "昭旺", "俊泽", "子中", "羽睿", "嘉雷", "鸿翔", "明轩",
        "棋齐", "轶乐", "昭易", "臻翔", "泽鑫", "芮军", "浩奕", "宏明", "忠贤", "锦辉",
        "元毅", "霈胜", "宇峻", "子博", "语霖", "胜佑", "俊涛", "浩淇", "乐航", "泽楷",
        "嘉宁", "敬宣", "韦宁", "建新", "宇怀", "皓玄", "冠捷", "俊铭", "一鸣", "堂耀",
        "轩凝", "舰曦", "跃鑫", "梓杰", "筱宇", "弘涛", "羿天", "广嘉", "陆铭", "志卿",
        "连彬", "景智", "孟昕", "羿然", "文渊", "羿楦", "晗昱", "晗日", "涵畅", "涵涤",
        "昊穹", "涵亮", "涵忍", "涵容", "俊可", "智鹏", "诚钰", "书墨", "俊易", "浩渺",
        "宸水", "嘉许", "时贤", "飞腾", "沂晨", "殿斌", "霄鸿", "辰略", "澜鸿", "景博",
        "咨涵", "修德", "景辉", "语旋", "智逸", "鸿锋", "思梵", "弈煊", "泰河", "逞宇",
        "嘉颢", "锦沅", "颢焱", "萧彬", "悦升", "香音", "烨柠", "颢咏", "仁贤", "尚然",
        "羿鳞", "月鸿", "健霖", "鸿昊", "竣杰", "可顺", "炯乐", "俊彦", "海沧", "捷明",
        "飞扬", "杰辰", "羽捷", "曦晴", "裕鸿", "翌锦", "沐宸", "福同", "旻驰", "龙宁",
        "文虹", "义凡", "广晨", "宸滔", "嘉岐", "雅珺", "睿明", "皓轩", "程天", "子酝",
        "艾康", "如羽", "冠玉", "子歉", "永昊", "龙华", "兆颜", "奇文", "月昕", "裕锦",
        "昂佳", "昊浩", "宇韬", "睿焓", "永译", "鸿彬", "颢霖", "益彬", "虹昊", "飞悦",
        "睿珏","?宵童", "睿鸿", "容冰", "逸濠", "楷岩", "弘义", "海萦", "昊孺", "梓铭",
        "生钊", "蓝玺", "晨辕", "宇菡", "砚海", "文揩", "韬瑞", "彦红", "奕韦", "清予",
        "宁翼", "冬睿", "锦昌", "烨宁", "昌权", "国研", "德运", "孝清", "佳阳", "凯玮",
        "正真", "民云", "昕冶", "力威", "帅欣", "知淳", "烨飞", "兴远", "子墨", "澄欣",
        "烨煊", "悦勤", "晨津", "博宏", "育萌", "羽炫", "绍钧", "睿昌", "泓千", "颢炜",
        "虹金", "筠航", "元甲", "星明", "景涛", "铭虹", "德本", "向辉", "基翔", "家易",
        "欣鹏", "羽荃", "泽容", "弘亮", "尚廷", "轩梓", "甫津", "彬楷", "寅飞", "愉君",
        "阳平", "誉杰", "钦昭", "蕴藉", "羽程", "宏海", "涵畅", "光浩", "令沂", "浩浩",
        "睿锦", "易泽", "俊康", "家文", "晨元", "语洋", "裕宏", "梓榛", "阳嘉", "恒展",
        "雨远", "哲伊", "逸江", "丰源", "学东", "奇岩", "浩财", "和蔼", "红言", "瑞赫",
        "森圆", "欣赢", "梓鸿", "博明", "铭育", "颢硕", "宇烯", "宇如", "淳炎", "源承",
        "斌彬", "飞沉", "鸿璐", "昊弘", "志禾", "禾浩", "博旭", "宇全", "太基", "森阳",
		"界万", "友鸿", "福东", "创金", "超天", "太益", "瑞旭", "雷蓝", "双阳", "迎瑞",
        "特友", "旺尚", "祥奇", "理大", "德顺", "原坚", "维超", "雅优", "赛宜", "莱吉",
        "韦复", "卓康", "白利", "德仕", "方凯", "跃祥", "顺来", "良彩", "微曼", "顺江",
        "裕爱", "同易", "斯星", "欧格", "磊良", "事友", "尼春", "讯联", "奥洲", "旭实",
        "海江", "博星", "亚成", "志润", "凡龙", "邦立", "旭巨", "隆丰", "扬新", "迈纳",
        "联美", "码凤", "奇科", "邦丝", "子莱", "创拓", "森风", "远易", "帝梦", "富网",
        "雅迎", "雷永", "奥英", "亚荣", "尔瑞", "曼尚", "佩冠", "启清", "易运", "中南",
        "邦鼎", "博惠", "大华", "展优", "生频", "裕耀", "览特", "明中", "宇典", "蓝明",
        "佳涛", "信方", "永凤", "腾高", "旭皇", "湖迎", "霸览", "东展", "翔语", "高泰",
        "界嘉", "坚科", "莱健", "语语", "欣迈", "晶源", "伟威", "奥联", "华真", "生欧",
        "吉派", "具恒", "真益", "湖贵", "精清", "雷频", "派罗", "领安", "微拓", "冠凯",
        "凡启", "风驰", "士妙", "娇洋", "天亚", "理嘉", "风时", "诗妙", "晖扬", "高好",
        "天鼎", "爱宇", "精能", "展旺", "恒林", "旺邦", "隆鸿", "吉康", "恒南", "同贸",
        "开永", "高旭", "开科", "凡凡", "阳鑫", "聚安", "嘉欧", "浩事", "月良", "安电",
        "实和", "盈娇", "明博", "长码", "浩跃", "江微", "万安", "振理", "益威", "风宏",
        "星双", "飞永", "聚频", "元月", "通星", "汉腾", "腾双", "卓森", "界欧", "福韦",
        "百智", "事龙", "讯仕", "风思", "白迈", "财典", "霸名", "迈凌", "思阳", "皇铭",
        "联凡", "聚立", "迈顺", "界嘉", "系南", "尼倍", "展梦", "明清", "祥缘", "频网",
        "晖志", "阳顺", "太金", "领汇", "帝生", "润诗"
    );

    var lastNames =  new Array(
        '建筑公司', '企业', '公司', '集团', '有限公司', '无限公司', '股份有限公司', '有限责任', '控股集团有限公司', '实业集团有限公司', '科技股份有限公司',
        '仪器仪表公司', '网络科技有限公司', '传媒有限公司', '瑞之谷医疗科技有限公司', '电气有限公司', '设备有限公司', '物联网科技有限公司', '电子有限公司',

    );

    var firstLength = firstNames.length;
    var lastLength = lastNames.length;

    var i = parseInt(  Math.random() * firstLength );
    var j = parseInt(  Math.random() * lastLength );
    var name = firstNames[i] + lastNames[j];

    return name;

}

console.log(getRandomName);
getRandomName()
console.log(getRandomName());